#+title: Lab_notes


** DONE Implement error plots for x/y/z
:PROPERTIES:
:Effort:   0:30
:END:
:LOGBOOK:
CLOCK: [2023-07-05 Wed 15:51]--[2023-07-05 Wed 16:11] =>  0:20
CLOCK: [2023-07-05 Wed 14:48]--[2023-07-05 Wed 15:40] =>  0:52
:END:

** DONE Find bug (?) why now pose estimates are sometimes under runway
:PROPERTIES:
:Effort:   0:15
:END:
:LOGBOOK:
CLOCK: [2023-07-05 Wed 16:21]--[2023-07-05 Wed 16:31] =>  0:10
CLOCK: [2023-07-05 Wed 16:11]--[2023-07-05 Wed 16:12] =>  0:01
:END:
*** DONE Visualize lines in 2d and 3d space
:PROPERTIES:
:Effort:   0:15
:END:
:LOGBOOK:
CLOCK: [2023-07-06 Thu 13:15]--[2023-07-06 Thu 13:43] =>  0:28
:END:
*** TODO Investigate math for Hough Transform
:PROPERTIES:
:Effort:   2h
:END:
:LOGBOOK:
CLOCK: [2023-07-06 Thu 13:43]--[2023-07-06 Thu 14:28] =>  0:45
:END:
*** DONE Baseline implementation
:PROPERTIES:
:Effort:   1.5h
:END:
:LOGBOOK:
CLOCK: [2023-07-07 Fri 14:13]--[2023-07-07 Fri 14:32] =>  0:19
CLOCK: [2023-07-07 Fri 12:50]--[2023-07-07 Fri 13:10] =>  0:20
CLOCK: [2023-07-07 Fri 10:21]--<2023-07-07 Fri 10:50> =>  0:29
:END:
**** DONE Fix bug with line vis / computation
:PROPERTIES:
:Effort:   1:00
:END:
:LOGBOOK:
CLOCK: [2023-07-07 Fri 14:49]--[2023-07-07 Fri 15:02] =>  0:13
:END:
Ended up having to use analytic formula and fix index messup
**** DONE Fix second bug
:PROPERTIES:
:Effort:   0:30
:END:
:LOGBOOK:
CLOCK: [2023-07-07 Fri 15:03]--[2023-07-07 Fri 15:19] =>  0:16
:END:
Pose estimates are wrong when using hough transform information
*** DONE Visualize Hough Transform
:PROPERTIES:
:Effort:   0:30
:END:
:LOGBOOK:
CLOCK: [2023-07-07 Fri 14:32]--[2023-07-07 Fri 14:48] =>  0:16
:END:
*** DONE Put some more toggles and maybe different noise bar
:PROPERTIES:
:Effort:   0:30
:END:
:LOGBOOK:
CLOCK: [2023-07-07 Fri 16:15]--[2023-07-07 Fri 17:05] =>  1:20
:END:
- [X] Probably simplify to three use/noise toggles
  + front corners
  + back corners
  + lines
- [X] Print result of optimization problem on click (using DataInspector)
- [-] Maybe make extra noise slider
- [X] When this is all done, probably merge into main.
*** TODO [#A] Investigate optimization convergence problems and bad results with Lines
:PROPERTIES:
:Effort:   0:45
:END:
:LOGBOOK:
CLOCK: [2023-07-07 Fri 17:05]--[2023-07-07 Fri 17:35] =>  0:30
:END:
**** DONE Make debugging plot of optimization landscape
:PROPERTIES:
:Effort:   0:45
:END:
:LOGBOOK:
CLOCK: [2023-07-10 Mon 12:54]--[2023-07-10 Mon 13:42] =>  0:48
CLOCK: [2023-07-10 Mon 10:40]--[2023-07-10 Mon 11:56] =>  1:16
CLOCK: [2023-07-10 Mon 09:52]--[2023-07-10 Mon 10:02] =>  0:10
:END:
- maybe use volumeslices
- or consider contourf, but can only plot f against 2 vars.

***** DONE Refactor projection onto camera position
:PROPERTIES:
:Effort:   0:30
:END:
:LOGBOOK:
CLOCK: [2023-07-10 Mon 14:36]--[2023-07-10 Mon 14:38] =>  0:02
CLOCK: [2023-07-10 Mon 13:51]--[2023-07-10 Mon 13:54] =>  0:03
:END:
***** DONE Refactor "coordiate transformations" using the package
:PROPERTIES:
:Effort:   0:15
:END:
:LOGBOOK:
CLOCK: [2023-07-10 Mon 14:38]--[2023-07-10 Mon 15:10] =>  0:32
:END:
***** DONE Just yield window as a result of a function that takes a position
:PROPERTIES:
:Effort:   0:20
:END:
:LOGBOOK:
CLOCK: [2023-07-10 Mon 15:10]--[2023-07-10 Mon 16:03] =>  0:53
:END:
***** DONE Make two windows, once which is the true position, and one which is the result of a click.
:PROPERTIES:
:Effort:   0:20
:END:
:LOGBOOK:
CLOCK: [2023-07-10 Mon 16:03]--[2023-07-10 Mon 16:14] =>  0:11
:END:
**** DONE [#A] Fix Hough transform bug in some situations.
:PROPERTIES:
:Effort:   0:40
:END:
:LOGBOOK:
CLOCK: [2023-07-10 Mon 17:02]--[2023-07-10 Mon 17:40] =>  0:38
:END:
**** TODO There's still another problem related to the optimization problem...
:PROPERTIES:
:Effort:   0:45
:END:
:LOGBOOK:
CLOCK: [2023-07-11 Tue 10:30]--[2023-07-11 Tue 10:52] =>  0:22
:END:
The problem is that there is a local minimum where $\rho$ has converged, but not $\theta$.
What can we do?
- regularize someohow
- unweigh rho
**** DONE Refactor a bit
:PROPERTIES:
:Effort:   0:35
:END:
:LOGBOOK:
CLOCK: [2023-07-10 Mon 16:18]--[2023-07-10 Mon 17:02] =>  0:44
:END:

